Enums/ТипыПриглашений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПриглашений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаИдентификатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Широковещательное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаРоуминг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПриглашений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыПриглашений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОтправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаемСогласия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяСогласие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаРоуминга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
					<Comment>Не является статусом приглашения, а используется только для отбора настроек отправки через прямой обмен.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяОтсоединить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПриглашенияЭДОСлужебныйКлиентСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область КлючиПриглашений

Функция КлючПриглашения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторОрганизации", "");
	Результат.Вставить("ИдентификаторКонтрагента", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	
	Возврат Результат;
	
КонецФункции

Функция КлючПриглашенияНаИдентификатор() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыПриглашений.НаИдентификатор"));
	Результат.Вставить("ИдентификаторОрганизации", "");
	Результат.Вставить("ИдентификаторКонтрагента", "");
	
	Возврат Результат;
	
КонецФункции

Функция КлючШироковещательногоПриглашения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыПриглашений.Широковещательное"));
	Результат.Вставить("ИдентификаторОрганизации", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	
	Возврат Результат;
	
КонецФункции

Функция КлючЗаявкиНаРоуминг() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыПриглашений.ЗаявкаНаРоуминг"));
	Результат.Вставить("ИдентификаторОрганизации", "");
	Результат.Вставить("ИдентификаторОператора", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПодсказкаЭлектроннаяПочтаДляУведомленияОСтатусеЗаявкиНаРоуминг() Экспорт
	
	Возврат НСтр("ru = 'На данный адрес электронной почты будут отправляться оповещения о статусе выполнения заявки по настройке роуминга'");
	
КонецФункции

Функция ВидПриглашенияИсходящее() Экспорт
	
	Возврат "Исходящее";
	
КонецФункции

Функция ЭтоВходящееПриглашение(Приглашение) Экспорт
	
	Возврат Приглашение.Вид = ВидПриглашенияВходящее();
	
КонецФункции

Функция ВидПриглашенияВходящее() Экспорт
	
	Возврат "Входящее";
	
КонецФункции

Функция ТипыПриглашений() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("НаИдентификатор", ПредопределенноеЗначение("Перечисление.ТипыПриглашений.НаИдентификатор"));	
	Результат.Вставить("Широковещательное", ПредопределенноеЗначение("Перечисление.ТипыПриглашений.Широковещательное"));	
	Результат.Вставить("ЗаявкаНаРоуминг", ПредопределенноеЗначение("Перечисление.ТипыПриглашений.ЗаявкаНаРоуминг"));	

	Возврат Новый ФиксированнаяСтруктура(Результат);
		
КонецФункции

#Область ОбработкаНеисправностей

// Возвращает вид ошибки, описывающий ситуацию, когда операция не может быть выполнена из-за того, что
// не настроена связь с контрагентом.
// 
// Параметры:
// 	СтатусПриглашения - ПеречислениеСсылка.СтатусыПриглашений
// 	ВидОперации - Строка - вид операции, при выполнении которой произошла ошибка, может 
// 	принимать значения "Распаковка", "Отправка".
// Возвращаемое значение:
//  См. ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки
Функция ВидОшибкиНеНастроенаСвязьСКонтрагентом(СтатусПриглашения, ВидОперации) Экспорт
	
	Если СтатусПриглашения = ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяСогласие") Тогда
		Идентификатор = "НеПринятоПриглашение" + ВидОперации;
		ОписаниеПроблемы = НСтр("ru = 'Не принято приглашение к обмену электронными документами'");
		Если ВидОперации = "Распаковка" Тогда
			ОписаниеРешения = НСтр("ru = 'Необходимо <a href = ""принять"">принять</a> приглашение.
				|После того как оно будет принято, транспортный контейнер можно будет распаковать.'");
		Иначе
			ОписаниеРешения = НСтр("ru = 'Необходимо <a href = ""принять"">принять</a> приглашение.
				|После того как оно будет принято, документ можно будет отправить.'");
		КонецЕсли;
	ИначеЕсли СтатусПриглашения = ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ОжидаемСогласия") Тогда 
		Идентификатор = "ОжидаетсяСогласиеНаПриглашение" + ВидОперации;
		ОписаниеПроблемы = НСтр("ru = 'Приглашение к обмену электронными документами находится в статусе ""Ожидаем согласие""'");
		ОписаниеРешения = НСтр("ru = 'Уточните у контрагента, принял ли он <a href = ""приглашение"">приглашение</a>.
					   |Если приглашение принято - <a href = ""обратитесь"">обратитесь</a> в тех. поддержку'");
	ИначеЕсли СтатусПриглашения = ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.Отклонено")
		Или СтатусПриглашения = ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.ТребуетсяОтправить") Тогда 
		Идентификатор = "ТребуетсяОтправкаПриглашения" + ВидОперации;
		ОписаниеПроблемы = НСтр("ru = 'Приглашение к обмену электронными документами еще не было отправлено'");
		Если ВидОперации = "Распаковка" Тогда
			ОписаниеРешения = НСтр("ru = 'Чтобы продолжить обмен электронными документами с контрагентом, отправьте <a href = ""приглашение"">приглашение</a>.
					   |После того как оно будет принято, транспортный контейнер можно будет распаковать.'");
		Иначе
			ОписаниеРешения = НСтр("ru = 'Чтобы продолжить обмен электронными документами с контрагентом, отправьте <a href = ""приглашение"">приглашение</a>.
					   |После того как оно будет принято, документ можно будет отправить.'");
		КонецЕсли;
	ИначеЕсли СтатусПриглашения = ПредопределенноеЗначение("Перечисление.СтатусыПриглашений.Ошибка") Тогда 
		Идентификатор = "ОшибкаПриглашения" + ВидОперации;
		ОписаниеПроблемы = НСтр("ru = 'Приглашение к обмену электронными документами находится в статусе ""Ошибка""'");
		ОписаниеРешения = НСтр("ru = '<a href = ""Обратитесь"">Обратитесь</a> в тех. поддержку'")
	ИначеЕсли СтатусПриглашения = Неопределено Тогда 
		Идентификатор = "НетПриглашения" + ВидОперации;
		ОписаниеПроблемы = НСтр("ru = 'Не настроена связь с контрагентом'");
		ОписаниеРешения = НСтр("ru = 'Не настроена связь с контрагентом'")
	Иначе
		Возврат ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
	КонецЕсли;
	
	Если ВидОперации = "Распаковка" Тогда
		ЗаголовокПроблемы = НСтр("ru = 'Не удалось распаковать транспортный контейнер ЭДО'");
	Иначе
		ЗаголовокПроблемы = НСтр("ru = 'Не удалось отправить электронный документ'");
	КонецЕсли;
	
	ОбработчикОткрытияПриглашения = "ПриглашенияЭДОКлиент.ОткрытьПриглашения";
	ОбработчикОткрытияФормыОбращенияВТехподдержку = 
		ОбработкаНеисправностейБЭДКлиентСервер.ОбработчикОткрытияФормыОбращенияВТехподдержку();
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = Идентификатор;
	ВидОшибки.ЗаголовокПроблемы = ЗаголовокПроблемы;
	ВидОшибки.ОписаниеПроблемы = ОписаниеПроблемы;
	ВидОшибки.ОписаниеРешения = ОписаниеРешения;
	ВидОшибки.ОбработчикиНажатия.Вставить("принять", ОбработчикОткрытияПриглашения);
	ВидОшибки.ОбработчикиНажатия.Вставить("приглашение", ОбработчикОткрытияПриглашения);
	ВидОшибки.ОбработчикиНажатия.Вставить("Обратитесь",	ОбработчикОткрытияФормыОбращенияВТехподдержку);
	ВидОшибки.ОбработчикиНажатия.Вставить("обратитесь", ОбработчикОткрытияФормыОбращенияВТехподдержку);
	ВидОшибки.ПараметрыОбработчиков.Вставить("принять", Новый Структура("Группировать", Истина));
	ВидОшибки.ПараметрыОбработчиков.Вставить("приглашение", Новый Структура("Группировать", Истина));
	
	Возврат ВидОшибки;
	
КонецФункции

Функция ВидОшибкиНеУдалосьНайтиКонтрагентаПоПриглашению() Экспорт
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "НеУдалосьНайтиКонтрагентаПоРеквизитамИзПриглашения";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Не удалось найти контрагента по реквизитам из приглашения'");
	ВидОшибки.ОписаниеРешения = 
		НСтр("ru = '<a href = ""Укажите"">Укажите</a> контрагентов в приглашениях.
			 |Для того, чтобы контрагенты создавались автоматически, <a href = ""ВключитеОпцию"">включите опцию</a>.'");
	ВидОшибки.ОбработчикиНажатия.Вставить("Укажите", "ПриглашенияЭДОКлиент.ОткрытьПриглашения");
	ВидОшибки.ОбработчикиНажатия.Вставить("ВключитеОпцию", "ПриглашенияЭДОКлиент.ВключитьОпциюАвтоматическогоСозданияКонтрагентов");
	ВидОшибки.Статус = ОбработкаНеисправностейБЭДКлиентСервер.СтатусыОшибок().Обычная;
	ВидОшибки.ВыводитьСсылкуНаСписокОшибок = Ложь;
	
	Возврат ВидОшибки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
